Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: Here is a small example, adapted from the last section:
ko: 여기 이전 장에서 가져온 작은 예제가 있습니다.

source: Here is an example of a calculation in the natural numbers that uses substitution combined with associativity, commutativity, and distributivity.
ko: 여기 자연수에 대한 대체과 결합성, 교환성, 분배성을 혼합한 계산 예제가 있습니다.

source: Here is an example of how the propositions-as-types correspondence gets put into practice.
ko: 여기에 유형으로써 명제 대응이 현장에서 어떻게 놓이는지에 대한 예제가 있습니다.

source: Here is an example of how we can carry out elementary reasoning with an equivalence relation:
ko: 이곳은 우리가 어떻게 동등 관계로 초등적인 추론을 하는지 예시를 보여줍니다.

source: Here is an example of rewriting using a compound expression:
ko: 여기서 복합 표현식을 사용하는 다시쓰기의 예제가 있습니다.

source: Here is an example with multiple constructors with arguments.
ko: 인자를 갖는 다수의 생성자 있는 예제가 있습니다.

source: Here is another example where we use the recursor Prod.casesOn instead of match.
ko: 여기에 match 대신 재귀자 Prod.casesOn을 사용하는 또다른 예제가 있습니다.

source: Here is another example, where we use the decidability of equality on the natural numbers to split on the cases m = n and m ≠ n.
ko: 여기 또 다른 예제가 있습니다. 우리는 m = n과 m ≠ n으로 나누도록 자연수에 대한 동등성의 결정가능성을 사용합니다.

source: Here is another example:
ko: 여기 또 다른 예제가 있습니다.

source: Here is another example: given any type α, the type List α denotes the type of lists of elements of type α.
ko: 또 다른 예제가 있습니다. α라 하는 임의의 타입에 대해 List α의 유형은 α 유형을 원소로 하는 리스트 유형을 가리킵니다.

source: Here is another useful trick.
ko: 여기 또 유용한 트릭이 있습니다.

source: Here is another: it adds elements of the first list to elements of the second list, until one of the two lists runs out.
ko: 여기 또 다른 것이 있습니다. 이것은 둘 중의 한 리스트의 원소가 소진될 때까지 첫 리스트의 원소를 두 번째 리스트의 원소와 더합니다.

source: Here is essentially the definition of division on the natural numbers that is found in the standard library.
ko: 여기 있는 것은 본질적으로 표준 라이브러리에서 찾을 수 있는 자연수에 대한 나눗셈 정의입니다.

source: Here is the example from the link above using Lean 4 implicit lambdas.
ko: 링크 위로부터 린 4의 암시적인 람다를 사용하는 에제가 있습니다.

source: Here is the same definition using a let rec instead of a where.
ko: where 대신 let rec을 사용한 같은 정의가 있습니다.

source: Here the rewrite tactic, abbreviated rw, uses h to replace x by 3 again.
ko: 여기 rewrite 전략은 rw로 축약되었고, h를 써서 x가 다시 3으로 바뀌게 했습니다.

source: Here the left arrow before Nat.add_assoc tells rewrite to use the identity in the opposite direction.
ko: Nat.add_assoc 앞의 왼쪽 화살표는 항등식을 반대 방향으로 사용해 다시쓰라고 말합니다.

source: Here the recursion is on x, and div.F x f : Nat → Nat returns the "divide by y" function for that fixed x.
ko: 여기서 재귀는 x에 있습니다. 그리고 div.F x f : Nat → Nat는 고정된 x에 대해 "y로 나눔" 함수를 반환합니다.

source: Here we use it not only to define a function, but also to carry out a proof by cases:
ko: 여기서 우리는 이것을 함수를 정의하는 것과 경우에 따른 증명을 수행하는데에도 사용합니다.

source: Here, generalize replaces a goal that could be proved using rfl with one that is not provable:
ko: 여기서 generalize는 rfl을 사용해 증명할 수 있는 목표를 증명가능하지 않은 것으로 바꿉니다.

source: Here, apply Or.inl; assumption is functionally equivalent to a single tactic which first applies apply Or.inl and then applies assumption.
ko: 여기 apply Or.inl; assumption는 기능적으로 apply Or.inl을 적용한 뒤 assumption을 적용한 한 개의 전략과 동등합니다.

source: Here, h hq establishes the equation x = y.
ko: 여기서 h hq가 방정식 x = y을 세웁니다.

source: Here, twice_double x is definitionally equal to the term (x + x) * (x + x).
ko: 여기서twice_double x도 항 (x + x) * (x + x)과 정의상으로 같습니다.

source: Here, for example, is a proof of ¬p → q → (q → p) → r:
ko: 여기 ¬p → q → (q → p) → r의 증명에 대한 예제가 있습니다.

source: Here, for example, is the definition of a semigroup:
ko: 예를 들어 여기 반군(半群, semigroup)의 정의가 있습니다.

source: Here, the axiom declaration postulates the existence of an element of the given type and may compromise logical consistency.
ko: 여기서 axiom 선언은 주어진 유형의 원소의 존재성을 가정하고 논리적 일관성을 타협할지도 모릅니다.

source: Here, the constructor tactic leaves the first component of the existential assertion, the value of x, implicit.
ko: 여기서 constructor 전략은 존재 가정의 첫 요소 암시적으로 x의 값으로 남깁니다.

source: Here, the value of the fib function at n + 2 (which is definitionally equal to succ (succ n)) is defined in terms of the values at n + 1 (which is definitionally equivalent to succ n) and the value at n.
ko: 여기서 (정의로 인해 succ (succ n)과 같은)n + 2에서 fib의 함수값은 (succ n와 정의로 인해 동등한)n + 1 에서의 값과 n에서 값에 대하여 정의되었다.

source: How can we prove the general theorem that next (previous d) = d for any Weekday d?
ko: 임의의 Weekday d에 대해 next (previous d) = d이라는 일반적인 일반적인 정리를 어떻게 증명할 수 있을까요?

source: How to deploy
ko: 작동시키는 법

source: However, functions such as compose are still quite verbose to define.
ko: 그러나 compose같은 함수들은 여전히 정의하기에 꽤 장황합니다.

source: However, in Section Setting Options, we will discuss Lean's mechanisms for setting options, which does not follow this pattern: options can only be set locally, which is to say, their scope is always restricted to the current section or current file.
ko: 하지만 Section Setting Options에서 우리는 린의 이 패턴을 따르지 않는 옵션 설정에 대한 메커니즘에 대해서 얘기할 것입니다. 옵션은 지역적으로만 설정될 수 있습니다. 그 말은 즉, 그들의 범위는 항상 현재 섹션이나 현재 파일로 제한됩니다.

source: However, it is natural to assume that the type of y and x should be the same in this kind of situation.
ko: 그러나 이 같은 상황에서 y형과 x형은 동일하다고 가정하는 것이 자연스럽습니다.

source: However, such commands often support the local modifier, which indicates that they only have effect until the current section or namespace is closed, or until the end of the current file.
ko: 하지만 이런 명령은 종종 이들이 현재 section이나 namespace이 닫힐 때까지 혹은 현재 파일의 끝까지만 유효하다는 것을 가리키는 local 수정자를 제공합니다.

source: However, this is often not the case with indexed inductive families such as vector α n, since case splits impose constraints on the values of the indices.
ko: 하지만 이것은 vector α n 같이 인덱스된 귀납형 군의 경우에는 적용이 안됩니다. 왜냐하면 경우를 나누기는 인덱스의 값에 제약을 부과하기 때문입니다.

source: However, you can use the combinator unhygienic to disable this restriction.
ko: 하지만 여러분은 unhygienic 조합자를 사용해서 이 제한을 해제할 수 있습니다.

source: Identifiers are generally camelCase, and types are CamelCase.
ko: 식별자들은 보통 camelCase이고 유형은 CamelCase입니다.

source: Identifiers in Lean can include any alphanumeric characters, including Greek characters (other than ∀ , Σ , and λ , which, as we have seen, have a special meaning in the dependent type theory).
ko: 린의 식별자들은 임의의 그리스 문자를 포함해 (우리가 본 ∀ , Σ , λ 외에도 종속 유형론에서 특별한 의미를 갖습니다.) 알파벳과 수치 문자를 포함할 수 있습니다.

source: If Lean tries to do so and fails, it returns with an error message "don't know how to synthesize placeholder," followed by the type of the term it is expecting, and all the objects and hypothesis available in the context.
ko: 만약 린이 그렇게 하려고 했는데 실패한다면 다음에 오는 항의 유형을 기대했다면서 "어떻게 자리 차지자를 동기화 해야할 지 모르겠다"는 오류 메시지를 반환합니다. 그리고 모든 객체와 가정들은 맥락에서 이용가능합니다.

source: If the unspecified fields cannot be inferred, Lean flags an error indicating the corresponding placeholder could not be synthesized.
ko: 만약 명시되지 않은 필드가 추론될 수 없다면 린은 대응하는 자리차지자를 합성할 수 없다고(the corresponding placeholder could not be synthesized) 나타내는 오류를 띄울 것입니다.

source: If q does not mention w, then showing that q follows from p w is tantamount to showing the q follows from the existence of any such x.
ko: q가 w를 언급하지 않았다면 p w로부터 q가 따름을 보이는 것으로 임의의 x의 존재함으로부터 q를 보이기에 충분합니다.

source: If foo is such a function, the notation @foo denotes the same function with all the arguments made explicit.
ko: 만약 foo가 그런 함수라면 @foo 표기는 모든 인수가 명시적으로 된 같은 함수를 지칭합니다.

source: If j is not 0, then (x : α) → β is an element of Sort (max i j).
ko: 만약 j가 0이 아니라면 (x : α) → β는 Sort (max i j)의 원소이다.

source: If p and q have been declared as variables, Lean will generalize them for us automatically:
ko: p와 q가 변수로 선언되었다면 린은 우리를 위해 자동적으로 일반화시킬 것입니다.

source: If p is any expression, ∀ x : α, p is nothing more than alternative notation for (x : α) → p, with the idea that the former is more natural than the latter in cases where p is a proposition.
ko: 만약 p가 임의의 표현식이면, ∀ x : α, p은 그저 (x : α) → p에 대한 대체 표현일 뿐입니다. 전자의 생각은 p가 명제인 후자의 경우보다 자연스럽습니다.

source: If RH represents the Riemann hypothesis, a classical mathematician is willing to assert RH ∨ ¬RH, even though we cannot yet assert either disjunct.
ko: 만약 RH가 리만 가설을 나타낸다면 우리가 아직 어느쪽에 분리자를 주장하지 않았더라도 고전 수학자는 RH ∨ ¬RH라고 기꺼이 주장할 겁니다.

source: If doing so reduces the goal to an identity t = t, the tactic applies reflexivity to prove it.
ko: 그렇게 하면 항등식 t = t로 목표를 축소합니다. 전략은 그것을 증명하는데 대칭성을 씁니다.

source: If it is a constant or an axiom, Lean indicates that fact, and shows the type.
ko: 만약 그것이 상수나 공리라면 린은 그 사실을 가리키고 유형을 보여줍니다.

source: If more than one record object is provided, then they are visited in order until Lean finds one that contains the unspecified field.
ko: 하나 이상의 레코드 개체가 제공되었다면 그럼 그들은 린이 명시되지 않은 필드를 포함하는 곳을 찾을 때까지 순서대로 방문될 것입니다.

source: If such a term appears in a hypothesis and you want to generalize over that as well, you need to revert it explicitly.
ko: 만약 그런 항이 가정에 나타나고 여러분이 그것에 대해서도 일반화하기 원한다다면 여러분은 그것을 명시적으로 revert 할 필요가 있습니다.

source: If that is not the one you want, you can use additional arguments to specify the appropriate subterm.
ko: 만약 이게 여러분이 원한 것이 아니라면 여러분은 추가 인수를 사용해 적절한 부분항을 명시할 수 있습니다.

source: If that were the extent of type class inference, it would not be all that impressive; it would be simply a mechanism of storing a list of instances for the elaborator to find in a lookup table.
ko: 그것이 유형 클래스 추론의 확장이라면 그리 인상적이지 않을 것 입니다. 이것은 협력기가 룩업 테이블에서 찾는 데 쓰는 단순히 개체의 리스트를 저장하는 메커니즘일 것입니다.

source: If the constructor name is not provided, then a constructor is named mk by default.
ko: 만약 생성자 이름이 없다면 생성자는 기본적으로 mk로 이름 붙습니다.

source: If the expression you case on does not appear in the goal, the cases tactic uses have to put the type of the expression into the context.
ko: 여러분이 경우를 나누려는 표현식이 목표에 나타나지 않는다면 cases 전략은 맥락에 표현식의 유형을 넣도록have 를 사용합니다.

source: If the identifier denotes a definition or theorem, Lean prints the type of the symbol, and its definition.
ko: 만약 식별자가 정의나 정리를 의미한다면 린은 기호의 유형과 그것의 정의를 출력합니다.

source: If the inaccessible pattern can be inferred, you can also write _.
ko: 만약 접근불가능한 패턴이 추론될 수 있다면 _와 같이 쓸 수 있습니다.

source: If the proof is incomplete, the token by is decorated with a red squiggly line, and the error message contains the remaining goals.
ko: 만일 증명이 불완전하다면, 토큰 by은 빨간색 구불구불한 선으로 장식됩니다. 그리고 오류 메시지가 남은 목표에 포함됩니다.

source: If the value of a field is not specified, Lean tries to infer it.
ko: 만약 필드의 값이 명시되지 않았다면, 린은 그것을 추론하려고 할 것입니다.

source: If there are multiple notations accepting the same longest parse, the choice will be delayed until elaboration, which will fail unless exactly one overload is type correct.
ko: 동일한 가장 긴 구문분석을 받아들이는 다수의 기호가 있다면 협력할 때까지 선택은 미뤄집니다. 그리고 이것은 정확히 한 오버로드가 유형이 옳바르지 않는 한 실패할 것 입니다.

source: If this command is used outside a namespace, the aliases are exported to the top level.
ko: 이 명령이 이름공간 밖에서 사용된다면 별명은 최상위 단계로 내보내지게 됩니다.

source: If two notations overlap, we again apply the longest parse rule:
ko: 만약 두 기호가 겹치면, 우리는 다시 가장 긴 구문분석 규칙을 적용합니다.

source: If we check the type of the recursor,
ko: 우리가 재귀자의 유형을 확인해보면

source: If you don't want that to happen, you have to write @t instead.
ko: 여러분이 이것이 일어나기 원하지 않는다면 대신 @t를 써줘야 합니다.

source: If you are ever in a situation where you need to supply an expression that Lean can infer by type class inference, you can ask Lean to carry out the inference using inferInstance:
ko: 린이 유형 클래스 추론으로 유추할 수 있는 표현식을 여러분이 제공해야 하는 상황에 있어 봤다면 여러분은 inferInstance를 사용해 린에게 추론을 이끌어내도록 요청할 수 있습니다.

source: If you are not used to thinking constructively, it may take some time for you to get a sense of where classical reasoning is used.
ko: 여러분이 직관적으로 생각하는데 익숙치 않다면 고전 추론이 사용되는 곳을 이해하는데 약간의 시간이 소요될지도 모릅니다.

source: If you are reading the book online, you will see a button that reads "try it!" Pressing the button opens up a tab with a Lean editor, and copies the example with enough surrounding context to make the code compile correctly.
ko: 여러분이 온라인으로 책을 읽는다면 "실행해보기"라 적힌 버튼을 볼 것입니다. 버튼을 누르면 린 편집기 탭이 열리면서 코드가 올바르게 컴파일되도록 주변 맥락을 포함해 예제를 복사합니다.

source: If you are using VS Code, you can read the results by hovering over the relevant theorem or definition, or opening the messages window with Ctrl-Shift-Enter.
ko: VS Code를 사용하는 경우 관련 정리 또는 정의 위로 마우스를 이동하거나 Ctrl-Shift-Enter로 메시지 창을 열어 결과를 읽을 수 있습니다.

source: If you do name a section, however, you have to close it using the same name.
ko: 그러나 여러분이 섹션에 이름을 붙이고자 한다면 같은 이름을 사용해 이를 닫아야 합니다.

source: If you do not name the constructor, Lean uses mk as a default.
ko: 여러분이 생성자의 이름을 지어주지 않는다면, 린은 mk를 기본 이름으로 사용합니다.

source: If you don't remember the order of the parameters but know their names, you can send the arguments in any order.
ko: 여러분이 매개변수의 순서를 기억하지 못해도 그들의 이름을 알면 여러분은 임의의 순서로든 인자를 보낼 수 있습니다.

source: If you have installed Lean on your own computer, you can find the library in the lean folder, and explore it with your file manager.
ko: 여러분이 여러분 컴퓨터에 린을 설치했다면 여러분은 lean 폴더에서 라이브러리를 찾을 수 있습니다. 그리고 파일관리자로 그것을 탐색할 수 있습니다.

source: If you leave out any of the cases in the following definition, the error message will let you know what has not been covered.
ko: 여러분이 다음 정의에서 어떤 경우라도 빠트리면, 오류 메시지가 어떤 것이 다뤄지지 못했는지 알릴 것입니다.

source: If you think of r y x as denoting a kind of order relation y ≺ x, then Acc r x says that x is accessible from below, in the sense that all its predecessors are accessible.
ko: 여러분이 r y x을 순서 관계 y ≺ x의 일종으로 나타났다고 생각한다면 Acc r x는 x가 아래로부터 접근가능하다고 말합니다. 이 관점으로부터 그것의 모든 전임자들은 접근가능합니다.

source: If you want to specify a witness to the existential quantifier explicitly, you can use the exists tactic instead:
ko: 여러분이 명시적으로 존재정량자를 나타내 보도록하길 원한다면, 대신exists 전략을 사용하면 됩니다.

source: If you want to use additional files, however, they need to be imported manually, via an import statement at the beginning of a file.
ko: 그러나 여러분이 추가 파일을 사용하길 원한다면 파일의 시작에서 import 구문을 통해 수동으로 불러와야 합니다.

source: Implement "constant fusion," a procedure that simplifies subterms like 5 + 7 to 12.
ko: "상수 융합,"의 구현은 5 + 7 to 12같은 부분항을 단순화하는 절차이다.

source: Implicit Arguments
ko: 암시적 인자(Implicit Arguments)

source: Implicit Lambdas
ko: 암시적인 람다

source: Importing Files
ko: 파일 불러오기

source: In Lean 4, we generalize this notation using · As a placeholder.
ko: 린 4에서 우리는 ·를 자리차지자로 사용하여 이 표기를 일반화합니다.

source: In either case, the defining equations hold definitionally.
ko: 각 경우에서 정의한 방정식들은 정의로 인해 성립합니다.

source: In general, instances may depend on other instances in complicated ways.
ko: 일반적으로 개체는 다른 개체에 복잡한 방식으로 종속될 수 있습니다.

source: In principle, two terms that reduce to the same value are called definitionally equal.
ko: 원리적으로 같은 값으로 축약되는 두 항은 정의상으로 동등(definitionally equal)하다고 합니다.

source: In the case of multiplication the latter is expressed as follows: x * (y * z) = y * (x * z).
ko: 곱셈의 경우 후자는 다음과 같이 표현됩니다.

source: In this case, however, apply would work just as well.
ko: 하지만 이 경우 apply도 마찬가지로 잘 작동할 것입니다.

source: In Chapter Inductive Types, we will explain how equality is defined from the primitives of Lean's logical framework.
ko: 귀납형 장에서 우리는 어떻게 동등이 린의 기초적인 논리 프레임워크로부터 정의되는지 설명할 것입니다.

source: In Section Implicit Arguments, we saw that if Lean displays the type of a term t as {x : α} → β x, then the curly brackets indicate that x has been marked as an implicit argument to t.
ko: Section Implicit Arguments에서 우리는 린은 항 t의 유형을 {x : α} → β x으로 표시하고 나서 중괄호는 x가 암시적인 인수로써 t로 표시되었음을 나타냄을 봤습니다.

source: In Section Notation below, we will discuss Lean's mechanisms for defining notation, and see that they also support the local modifier.
ko: 아래 Section Notation에서 우리는 린의 기호를 정의하는 메커니즘에 대해 얘기하고 또 이들이 local 수정자를 지원함을 볼 예정입니다.

source: In Section Using the Simplifier, we saw that theorems can be annotated with the [simp] attribute, which makes them available for use by the simplifier.
ko: Section Using the Simplifier에서 우리는 정리들이 단순화기에 의한 사용이 가능하도록 만드는 [simp] 특성이 붙는 것을 보았습니다.

source: In t₁ <;> t₂, the <;> operator provides a parallel version of the sequencing operation: t₁ is applied to the current goal, and then t₂ is applied to all the resulting subgoals:
ko: t₁ <;> t₂에서 <;> 연산자는 순차 연산의 버전에 대해 parallel을 제공합니다. t₁는 현재 목표에 적용되고 그 후 t₂은 출력되는 하위목표 all에 적용됩니다.

source: In Chapter Axioms and Computation, we will see that using the law of the excluded middle to define functions can prevent them from being used computationally.
ko: 공리와 계산 장에서 우리는 배중률을 사용해 함수를 정의하는 것은 그들이 계산적으로 사용되는 것을 막을 수 있음을 볼 것입니다.

source: In Section Dependent Pattern Matching, we will see that it is sometimes necessary to include explicit terms in patterns that are needed to make an expression type check, though they do not play a role in pattern matching.
ko: 이들이 패턴 매칭에 핵심 역할을 하지 않더라도 의존적인 패턴 매칭 섹션에서 우리는 이것이 때때로 표현식 유형 확인을 만드는데 필요한 패턴에 대해 명시적으로 포함될 필요가 있음을 볼 것입니다.

source: In Emacs, you can see the goal at the end of any line by pressing C-c C-g, or see the remaining goal in an incomplete proof by putting the cursor after the first character of the last tactic.
ko: Emacs에서 여러분은 임의의 줄의 끝에서 C-c C-g을 눌러 목표를 볼 수 있습니다. 아니면 마지막 전략의 첫 문자 뒤에 커서를 놓으면 불완전한 증명에 대한 나머지 목표를 볼 수 있습니다.

source: In Emacs, you can use C-c C-x to run an independent Lean process on your file, and the output buffer will show a trace every time the type class resolution procedure is subsequently triggered.
ko: Emacs에서 C-c C-x를 사용하여 파일에서 독립적인 린 프로세스를 실행할 수 있으며 출력 버퍼는 유형 클래스 해결 절차가 이후에 사용될 때마다 추적을 표시합니다.

source: In Lean 3 stdlib, we find many instances of the dreadful @+_ idiom.
ko: 린 3의 표준라이브러리에서 우리는 치명적인 @+_ 구문의 수 많은 instances를 발견했습니다.

source: In Lean 3, we can create simple functions from infix operators by using parentheses.
ko: 린 3에서는 괄호를 사용해 전위 연산자로부터 간단한 함수를 만들 수 있습니다.

source: In Lean 4, the elaborator automatically introduces lambdas for consuming implicit arguments.
ko: 린 4에서 협력기는 자동적으로 암시적인 인자를 소모하기 위해 람다를 도입합니다.

source: In Lean, a calculation proof starts with the keyword calc, and has the following syntax:
ko: 린에서 계산 증명은 키워드 calc로 시작합니다. 그리고 다음 문법을 갖습니다.

source: In Lean, by changing structure to class in the example above, the type of Add.add becomes
ko: 린에서 위 예제에서structure를 class로 바꿈으로 Add.add형이 됩니다.

source: In Lean, identifiers are given by hierarchical names like Foo.Bar.baz.
ko: 린에서 식별자는 Foo.Bar.baz처럼 계층적인 names으로 제시됩니다.

source: In Lean, one uses an underscore, _, to specify that the system should fill in the information automatically.
ko: Lean에서 누군가는 시스템이 자동적으로 정보를 채워넣도록 명시하기 위해 밑줄문자(_)를 사용합니다.

source: In Lean, the theorem command introduces a new theorem:
ko: 린에서 theorem 명령은 새로운 정리를 도입합니다.

source: In Lean, the keyword structure can be used to define such an inductive type as well as its projections, at the same time.
ko: 린에에서 키워드 structure는 그것의 투영 뿐만 아니라 귀납형 같은 것을 동시에 정의하는데 사용될 수 있습니다.

source: In Lean, the syntax for specifying such a type is as follows:
ko: 린에서 그런 유형을 나타내는 문법은 다음과 같습니다.

source: In Lean, the type of natural numbers, Nat, is different from the type of integers, Int.
ko: 린에서 자연수 유형 Nat은 정수의 유형 Int과는 다릅니다.

source: In VS Code, you can open a window to display messages by pressing Ctrl-Shift-Enter, and that window will then show you the current goal whenever the cursor is in a tactic block.
ko: VS Code에서 여러분은 Ctrl-Shift-Enter을 눌러 메시지을 보고자 창을 열 수 있습니다. 그러면 이 창은 전략 블록 속의 커서가 어디에 있든지 간에 현재 목표를 여러분에게 보여줄 것입니다.

source: In a nested block, Lean focuses on the first goal, and generates an error if it has not been fully solved at the end of the block.
ko: 중첩된 블럭 속에 Lean은 첫번째 목표에 집중하고 블록 끝에서도 완전히 풀리지 않는다면 오류를 발생시킵니다.

source: In a proof, there are often multiple goals outstanding.
ko: 증명에서 종종 두드러진 다수의 목표들이 있습니다.

source: In a similar way, ∃ x : α, p is a Prop-valued variant of Σ x : α, p.
ko: 마찬가지로 ∃ x : α, p은 Σ x : α, p의 Prop 값이 매겨진 변형입니다.

source: In addition to apply and exact, another useful tactic is intro, which introduces a hypothesis.
ko: apply과 exact에 더해 또 다른 유용한 전략은 가정을 도입하는 intro입니다.

source: In addition to axioms, however, we would also need rules to build new proofs from old ones.
ko: 하지만 공리에 더해 우리는 이전 증명으로부터 새로운 증명을 만드는데 사용할 규칙도 필요합니다.

source: In addition, you can use the #print command to get information about any identifier.
ko: 게다가 여러분은 #print 명령을 사용해서 임의의 식별자에 대한 정보를 얻을 수 있습니다.

source: In all cases, the command #print t1 still yields ∀ p q : Prop, p → q → p.
ko: 모든 경우에 명령 #print t1은 여전히 ∀ p q : Prop, p → q → p을 출력합니다.

source: In all these cases, the attribute remains in effect in any file that imports the one in which the declaration occurs.
ko: 모든 경우에 대해서, 특성은 선언이 있는 파일을 불러온 임의의 파일에 대해 영향을 미칩니다.

source: In all these examples, pattern matching was used to carry out a single case distinction.
ko: 이 모든 에제에서 패턴 매칭은 한 경우의 구별을 수행하는데 사용됩니다.

source: In any case, all that really matters is the bottom line.
ko: 어떤 경우에는 가장 중요한 것은 아래의 문장입니다.

source: In any case, the additional rules are added to the collection of identities that are used to simplify a term.
ko: 어떤 경우에 항을 간단히 하는데 사용되는 항등식의 모임에 추가 규칙이 더해질 수 있습니다.

source: In both cases, Lean generates the auxiliary function fibFast.loop.
ko: 두 경우 모두에 대해 린은 부가 함수 fibFast.loop를 만듭니다.

source: In contrast to usage outside the equation compiler, here the underscore does not indicate an implicit argument.
ko: 방정식 컴파일러 밖에서의 사용과 대조적으로 여기서 밑줄 문자는 암시적인 인수를 지칭하지 않습니다.

source: In contrast to ordinary inductive definition, which constructs an element of some Sort u, the more general version constructs a function ... → Sort u, where "..." denotes a sequence of argument types, also known as indices.
ko: 어떤 Sort u의 원소를 생성하는 평범한 재귀적 정의와는 반대로 더 일반적인 형태는 함수 ... → Sort u을 생성합니다. 한편, "..."은 indices로도 알려진 인수 유형의 나열을 의미합니다.

source: In contrast, infixr reuses the notation's precedence for the right-hand side operand, so a ^ b ^ c can be parsed as a ^ (b ^ c).
ko: 반대로, infixr은 우변의 피연산자 표기의 우선순위를 재사용합니다. 그래서 a ^ b ^ c은 a ^ (b ^ c)으로 구문분석 될 수 있습니다.

source: In contrast, interactive theorem proving focuses on the "verification" aspect of theorem proving, requiring that every claim is supported by a proof in a suitable axiomatic foundation.
ko: 반대로 상호작용 증명기는 모든 진술은 적절한 공리적 기초에 의한 증명으로 지지될 것을 요구하면서 정리 증명의 "식별" 측면에 초점을 둡니다.

source: In contrast, if we think in terms of the coding trick described above, then the expressions themselves do not denote anything interesting.
ko: 반대로 위에서 설명한 코딩 트릭으로 생각한다면 표현식 그 자체는 어떤 흥미로운 것도 나타내지 않습니다.

source: In contrast, the constructor succ can only be applied to a previously constructed Nat.
ko: 반대로 생성자 succ은 이전에 생성된 Nat에만 적용될 수 있습니다.

source: In contrast, the sum type has two constructors, inl and inr (for "insert left" and "insert right"), each of which takes one (explicit) argument.
ko: 대조적으로 합 유형은 두 생성자 inl과 inr이 있습니다. ("왼쪽 삽입"과 "오른쪽 삽입" 의미) 각각은 한개의 (명시적인) 인수를 받습니다.

source: In each file, you need to open the namespaces you wish to use.
ko: 각 파일에서 여러분은 여러분이 사용하려는 이름공간을 열어야 합니다.

source: In each of the following examples, splitting occurs on only the first argument, even though the others are included among the list of patterns.
ko: 다른 인수들도 패턴의 리스트 사이에 포함되어 있음에도 다음의 각 예제에서 분할은 첫 번째 인수에만 일어납니다.

source: In fact, all builtin syntax is parsed and processed using the same mechanisms and APIs open to users.
ko: 사실 모든 내장 문법은 같은 메커니즘과 사용자에게 개방된 API를 사용하여 구문분석되고 처리됩니다.

source: In fact, the expression denotes the same function as fun (u : β) (z : α) => u.
ko: 사실 표현식은 fun (u : β) (z : α) => u처럼 같은 함수를 가리킵니다.

source: In fact, Lean allows us to define the inductive type we really want:
ko: 사실 린은 우리가 원하는 귀납형을 정의하도록 해줍니다.

source: In fact, Lean is generally able to process and check proofs in parallel, since assessing the correctness of one proof does not require knowing the details of another.
ko: 사실, 어떤 증명의 옳음에 접근하는 것은 다른 것의 상세를 알 필요가 없기 때문에 린은 일반적으로 증명의 검증과 처리를 병렬적으로 할 수 있습니다.

source: In fact, a single inductive definition can introduce an indexed family of inductive types, in a manner we now describe.
ko: 사실 단일 재귀적 정의는 이제 우리가 설명할 방식으로 귀납형의 색인된 family를 도입할 수 있습니다.

source: In fact, by the propositions-as-types correspondence, we can declare the assumption hp that p holds, as another variable:
ko: 사실 유형으로써 명제 대응에 의해 우리는 p를 가진 가정 hp를을 또다른 변수로 선언할 수 있습니다.
